app/controllers/books_controller.rb

  def index

    @books = Book.where(availability: true)
---
SELECT "books".* FROM "books" WHERE "books"."availability" = 't'

  def create
    @book = current_user.books.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "author", "description", "price", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "cass"], ["author", "jake"], ["description", "wifepoo"], ["price", 100000000], ["user_id", 1], ["created_at", "2015-06-24 01:17:16.991833"], ["updated_at", "2015-06-24 01:17:16.991833"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "description" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["description", "first book alot of other writing to fill out some description"], ["updated_at", "2015-04-21 02:14:24.278246"], ["id", 1]]